app/views/posts/index.html.erb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" IS NULL
---
	<h1>All Your Friends</h1>
	<% Friendship.where(user:current_user).each do |fr|%>